#N1
# # Flow chart არის სქემა/დიაგრამა, რომელიც გვიჩვენებს
# როგორ გადადის პროგრამა ან პროცესი ნაბიჯ-ნაბიჯ

#N2
# Sequencing ნიშნავს, რომ კოდი სრულდება ზუსტად იმ რიგით,
# როგორიც წერია. ერთი ხაზის შემდეგ მოდის მეორე ხაზი.
# პროგრამა ნაბიჯ-ნაბიჯ მიყვება ინსტრუქციებს.

# Selection ნიშნავს, რომ პროგრამა ირჩევს სხვადასხვა გზას
# პირობის მიხედვით. ანუ კოდი შეიძლეოს ორ ან მეტ მიმართულებაში წავიდეს.

# Iteration ნიშნავს, რომ მოქმედება განმეორდეს ბევრჯერ.
# ანუ ერთი და იგივე კოდი ტრიალდება ისევ და ისევ,
# სანამ პირობა არ შესრულდება ან სანამ ციკლი არ დამთავრდება.


#N3
# მომხმარებელს შემოატანინეთ ფარენჰეიტის ტემპერატურა
fahrenheit = float(input("შეიყვანეთ ფარენჰეიტის ტემპერატურა: "))

# ფორმულა: C = (F - 32) * 5/9
celsius = (fahrenheit - 32) * 5/9

# შედეგის გამოტანა
print("ცელსიუსში ტემპერატურა არის:", celsius)


#N4
# მომხმარებელს შემოვატანინოთ გრძელი სიტყვა
word = input("შეიყვანეთ გრძელი სიტყვა: ")

# ამოვჭრით ასოებს ინდექსებიდან 2-დან 8-მდე
middle_part = word[2:8]

# დაბეჭდვა
print("ამოჭრილი შუა ნაწილი არის:", middle_part)
