# 2) ფუნქცია არის კოდის ბლოკი, რომელსაც აქვს სახელი
# და რომელიც ასრულებს კონკრეტულ დავალებას.
# ფუნქცია გვეხმარება, რომ კოდი არ გავიმეოროთ
# და უფრო მარტივად, ორგანიზებულად დავწეროთ პროგრამა.


# 3) print() არის ჩაშენებული (built-in) ფუნქცია Python-ში.
# ის გამოიყენება ეკრანზე ინფორმაციის გამოსატანად.
# მაგალითად, ტექსტის, რიცხვის ან ცვლადის მნიშვნელობის დაბეჭდვისთვის.


# 4) არგუმენტები არის მონაცემები,
# რომლებიც გადაეცემა ფუნქციას მრგვალ ფრჩხილებში.
# მაგალითად print("Hello") — აქ "Hello" არის print() ფუნქციის არგუმენტი.


# 5) f-string-ის გამოყენება დიდი წინადადების შესაქმნელად

name = "დემეტრე"
age = 13
favorite_anime = "Attack On Titan"
goal = "Programming"

sentence = f"მე მქვია {name}, ვარ {age} წლის. ჩემი საყვარელი ანიმაციაა {favorite_anime} და ჩემი მთავარი მიზანია მომავალში გავხდე {goal}."

print(sentence)
