# კომენტარების სახით თქვენი სიტყვებით ახსენით რა არის კონკატინაცია.
#კონკატინაცია ნიშნავს ორი ან მეტი ტექსტის (სტრიქონის) ერთმანეთზე მიმატებას — ანუ როდესაც რამდენიმე სიტყვა ან წინადადება ერთ მთლიან სტრიქონად ერთიანდება. მაგალითად

name = "დემეტრე"
surname = "გელაშვილი"
fullname = name + " " + surname  # ← აქ ხდება კონკატინაცია
print(fullname)

# შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი termian-ში.

# სამი ცვლადის შექმნა
num1 = 5
num2 = 10
num3 = 7

# მათი ჯამის დაბეჭდვა
print(num1 + num2 + num3)

# შექმენით ორი ცვლადი length და width(მართკუთხედის გვერდები), მიანიჭეთ მნიშვნელობებად 20 და 10. გამოითვალეთ მართკუთხედის პერიმეტრი და შემდეგ კი დაპრინტეთ პასუხი termianl-ში.


# მართკუთხედის გვერდების ცვლადები
length = 20
width = 10

# პერიმეტრის გამოთვლა (2 * (length + width))
perimeter = 2 * (length + width)

# შედეგის დაბეჭდვა
print(perimeter)

#გააკეთეთ 3-3 მაგალითი ყველა მათემატიკურ ოპერაციებზე.


#  შეკრება (Addition)
print(5 + 3)
print(10 + 7)
print(15 + 20)

#  გამოკლება (Deduction)
print(10 - 4)
print(25 - 9)
print(100 - 45)

#  გამრავლება (Multiplication)
print(5 * 2)
print(7 * 3)
print(9 * 9)

#  გაყოფა (Division)
print(10 / 2)
print(25 / 5)
print(9 / 3)

# // მთელრიცხვითი გაყოფა (Floor Division)
print(10 // 3)
print(25 // 4)
print(100 // 6)

# % ნაშთის პოვნა (Modulus)
print(10 % 3)
print(25 % 4)
print(18 % 5)

# ** ახარისხება (Exponentiation)
print(2 ** 3)
print(5 ** 2)
print(10 ** 3)

# შექმენით ცვლადები და შეინახეთ მათში თქვენთვის სასურველი ინფორმაცია, შემდეგ კი ააწყეთ ერთი დიდი წინადადება ამ ცვლადებისა და მნიშვნელობების გამოყენებით.


# ცვლადების შექმნა
name = "დემეტრე"
age = 13
city = "თბილისი"
favfood = "ხინკალი"
dream = "პროგრამირება"

# ერთი დიდი წინადადების აწყობა
sentence = "ჩემი სახელია " + name + ", მე ვარ " + str(age) + " წლის, ვცხოვრობ ქალაქ " + city + "-ში, " \
            "მიყვარს " + favfood + " და ჩემი ოცნებაა " + dream + "."

# შედეგის დაბეჭდვა
print(sentence)












