#N1
# Flowchart:
#   Flowchart არის სქემა/დიაგრამა, რომელიც ნაბიჯ-ნაბიჯ აჩვენებს პროცესს ან პროგრამის მუშაობას.
#   გამოიყენება იმისათვის, რომ ვიზუალურად გავიგოთ რა უნდა გააკეთოს ალგორითმმა.


# Sequencing:
#   Sequencing ნიშნავს, რომ კოდი სრულდება ზუსტად იმ თანმიმდევრობით, როგორც წერია.
#   ანუ ნაბიჯები მოდიან ერთის შემდეგ მეორე, ზედიზედ.



# Iteration:
#   Iteration ნიშნავს გამეორებას (ლუპს). 
#   პროგრამა ერთსა და იმავე მოქმედებას ასრულებს რამდენჯერმე.


# Selection:
#   Selection ნიშნავს არჩევანს პირობიდან გამომდინარე 


# Pseudocode:
#   Pseudocode არის "ფსევდოკოდი" — ტექსტური აღწერა, 
#   რომელიც ჰგავს კოდს, მაგრამ არ არის რეალური პროგრამირების ენა.
#   გამოიყენება ალგორითმის მოფიქრებისას.



# Natural Language:
#   Natural Language ნიშნავს ჩვეულებრივ, ადამიანურ ენაზე (ქართული/ინგლისური) 
#   გადმოცემულ ინსტრუქციებს ალგორითმის შესახებ.
#   მაგალითი:
#       მომხმარებელმა უნდა შეიყვანოს რიცხვი.
#       პროგრამამ უნდა შეამოწმოს, თუ რიცხვი ნულზე მეტია.
#       თუ მეტია – დაბეჭდოს "დადებითი", თუ არა – "უარყოფითი".

